export const commentsData = [
    // کامنت‌های فیلم Interstellar (id: 1)
    {
        id: 101,
        movieId: 1,
        author: "رضا علوی",
        date: "۱۴۰۳/۰۲/۱۰",
        text: "موسیقی متن هانس زیمر در این فیلم فراتر از یک شاهکار است. پایان‌بندی فیلم واقعاً تکان‌دهنده بود.",
        rating:3
    },
    {
        id: 102,
        movieId: 1,
        author: "مریم اسدی",
        date: "۱۴۰۳/۰۳/۱۵",
        text: "بهترین فیلم علمی‌تخیلی که تا به حال دیدم. مفاهیم زمان و عشق را به زیباترین شکل ترکیب کرده بود.",
        rating:5
    },

    // کامنت‌های فیلم Inception (id: 2)
    {
        id: 201,
        movieId: 2,
        author: "سهیل نوری",
        date: "۱۴۰۲/۱۱/۰۵",
        text: "هنوز هم بعد از چند بار دیدن، لایه‌های جدیدی از داستان رو کشف می‌کنم. نولان نابغه است.",
        rating:2
    },

    // کامنت‌های سریال Peaky Blinders (id: 3)
    {
        id: 301,
        movieId: 3,
        author: "حسین ابراهیمی",
        date: "۱۴۰۳/۰۱/۲۰",
        text: "بازی سیلیان مورفی در نقش تامی شلبی بی‌نظیر است. طراحی لباس و فضای بیرمنگام عالی از آب درآمده.",
        rating:5
    },
    {
        id: 302,
        movieId: 3,
        author: "نازنین راد",
        date: "۱۴۰۳/۰۴/۰۲",
        text: "جذاب‌ترین سریال گانگستری! هر فصل هیجانش بیشتر میشه.",
        rating:4
    }
];
